#+TITLE:CC Class Notes
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:Followup class notes for CSC100 Intro to Programming in C/C++ Spring 2022
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
** The ~pun.c~ program

   Check the [[glossary]] for details. The output, by the way, does not
   look good on GitHub.

   #+name: pun
   #+begin_src C :main yes :include stdio.h :results raw
     printf("To C, or not to C, that is the question.\n");
   #+end_src

   #+RESULTS: pun
   To C, or not to C, that is the question.

   #+name: pun1
   #+begin_src C :results raw
     #include <stdio.h>

     int main(void)
     {
       printf("To C, or not to C, that is the question.\n");
       return 0;
     }
   #+end_src

   #+RESULTS: pun1
   To C, or not to C, that is the question.

   #+name: newline
   #+begin_src C :main yes :include stdio.h :results raw
     printf("To C, or not to C,\n that is the question.\n");
   #+end_src

   #+RESULTS: newline
   To C, or not to C,
   that is the question.


   #+name: smiley
   #+begin_src C :main yes :include stdio.h :results raw
     printf("O         O\n");
     printf("     | \n");
     printf("\n");
     printf(" *       * \n");
     printf("   * * * \n");
   #+end_src

   #+RESULTS: smiley
   O         O
   |

   *       *
     * * *


*** MATCH PROGRAM ELEMENT AND DEFINITION!

    - The directive has to be at the top of the program
    - The ~main~ function has to be there (there can be other
      functions, but it has to run first)
    - The statement is not necessary but it's what is executed

    | C SOURCE CODE            | MEANING                                |
    |--------------------------+----------------------------------------|
    | ~#include <stdio.h>~     | Directive (input/output library)       |
    | ~int main(void) { ... }~ | Main function (without input argument) |
    | ~printf("hello\n");~     | Program statement (screen display)     |

    - Here is a function definition outside of ~main()~ that does the
      same job as our hello world program - print out ~hello
      world~. To demonstrate the relationship between our own function
      ~hello()~ and ~main()~, I am not using any ~header-args~ in the
      block [[hello function]].
      #+name: hello function
      #+begin_src C :tangle hellof.c
        #include <stdio.h>
        hello() {
          printf("hello function world\n");
        }
        int main(void){
          hello();
          return 0;
        }
      #+end_src

      #+RESULTS: hello function
      : hello function world

    * Which of these are NOT valid PATH settings?
    * The "binary" of a program (like gcc) is machine code that runs
      on any type of computer.
    * Which symbols mark Org-mode metadata?
      - #+
      - /* */
      - //

